[
    {
        "question": "What role does guilt play in Amir's relationship with Hassan in 'The Kite Runner'?",
        "context": "In Khaled Hosseini's 'The Kite Runner,' Amir struggles with guilt for betraying his childhood friend Hassan. This guilt becomes a driving force for his later attempts at redemption. The novel explores themes of loyalty, forgiveness, and the long-term impact of unresolved guilt."
    },
    {
        "question": "How does Jane Eyre assert her independence in the face of societal norms?",
        "context": "In Charlotte Brontë's 'Jane Eyre,' the protagonist challenges the rigid gender roles and class structures of Victorian England. Despite facing significant adversity, Jane insists on maintaining her self-respect and autonomy, particularly in her relationships and career."
    },
    {
        "question": "What does the green light symbolize in 'The Great Gatsby'?",
        "context": "In F. Scott Fitzgerald's 'The Great Gatsby,' the green light at the end of Daisy's dock represents Gatsby's hopes and dreams for the future. It also symbolizes the broader theme of the American Dream and its unattainability."
    },
    {
        "question": "How does George Orwell explore the theme of surveillance in '1984'?",
        "context": "In '1984,' George Orwell presents a dystopian society where the government exercises total control over its citizens through constant surveillance. The use of technologies like telescreens and the presence of the omnipresent 'Big Brother' highlight the loss of privacy and freedom."
    },
    {
        "question": "What role does social class play in the relationships depicted in 'Pride and Prejudice'?",
        "context": "In Jane Austen's 'Pride and Prejudice,' social class significantly influences romantic and familial relationships. The novel critiques the rigid class distinctions of Regency England and explores how they impact characters like Elizabeth Bennet and Mr. Darcy."
    },
    {
        "question": "How does 'To Kill a Mockingbird' address the theme of moral courage?",
        "context": "In Harper Lee's 'To Kill a Mockingbird,' moral courage is exemplified through characters like Atticus Finch, who defends Tom Robinson despite societal backlash. The novel emphasizes the importance of standing up for justice, even when faced with adversity."
    },
    {
        "question": "What is the significance of the title 'Of Mice and Men'?",
        "context": "John Steinbeck's 'Of Mice and Men' draws its title from Robert Burns' poem, 'To a Mouse.' The title reflects the fragility of dreams and plans, a central theme in the story of George and Lennie as they strive for a better life during the Great Depression."
    },
    {
        "question": "How does Mary Shelley explore the theme of isolation in 'Frankenstein'?",
        "context": "In 'Frankenstein,' Mary Shelley examines the consequences of isolation through Victor Frankenstein and the Creature. Both characters experience profound loneliness, which drives their actions and highlights the importance of companionship and empathy."
    },
    {
        "question": "What role does fate play in the lives of Romeo and Juliet?",
        "context": "In Shakespeare's 'Romeo and Juliet,' fate is a recurring theme, often represented through the characters' references to omens and destiny. The concept of 'star-crossed lovers' underscores the inevitability of their tragic end."
    },
    {
        "question": "How does J.K. Rowling portray the theme of choice in 'Harry Potter and the Chamber of Secrets'?",
        "context": "In 'Harry Potter and the Chamber of Secrets,' J.K. Rowling explores the theme of choice through Harry's decisions, particularly in his interactions with the Sorting Hat and Tom Riddle's diary. The novel emphasizes the power of choices in shaping identity and destiny."
    },
    {
        "question": "How does the narrative structure in 'Cloud Atlas' emphasize the interconnectedness of human lives?",
        "context": "David Mitchell's 'Cloud Atlas' employs a nested narrative structure, intertwining six different stories across time periods. Each story influences the next, revealing how actions ripple through time and connect disparate lives."
    },
    {
        "question": "What is the role of unreliable narration in 'The Girl on the Train'?",
        "context": "In Paula Hawkins' 'The Girl on the Train,' the story is told through the perspectives of three women, each with personal biases and incomplete memories. This technique adds layers of complexity and challenges the reader's perception of truth."
    },
    {
        "question": "How does the concept of 'The Loop' in 'Dark Matter' explore the philosophical implications of choice?",
        "context": "In Blake Crouch's 'Dark Matter,' the protagonist, Jason, encounters infinite versions of himself in a multiverse created by quantum choices. The novel examines how individual decisions shape identity and the consequences of unlimited possibilities."
    },
    {
        "question": "How does Toni Morrison use symbolism to address intergenerational trauma in 'Beloved'?",
        "context": "In 'Beloved,' Toni Morrison uses symbols like the haunting ghost of Beloved and the scars on Sethe's back to represent the lingering impact of slavery on personal and collective memory. These symbols delve into themes of trauma and healing."
    },
    {
        "question": "In 'Circe,' how does Madeline Miller reinterpret Greek mythology to critique power dynamics?",
        "context": "Madeline Miller's 'Circe' retells the story of the witch from the Odyssey, portraying her as a complex character who resists the oppressive forces of gods and mortals. The novel critiques traditional power structures and explores autonomy."
    },
    {
        "question": "What role does systemic oppression play in the dystopian society of 'The Handmaid’s Tale'?",
        "context": "In Margaret Atwood's 'The Handmaid's Tale,' systemic oppression is institutionalized through Gilead's laws, stripping women of their rights. The narrative explores the mechanisms of control, such as surveillance and propaganda, to sustain the regime."
    },
    {
        "question": "How does the epistolary format in 'The Color Purple' deepen the emotional impact of the story?",
        "context": "Alice Walker's 'The Color Purple' is written as a series of letters, primarily from Celie to God. This format allows intimate insights into Celie's thoughts and feelings, emphasizing her resilience and growth in the face of adversity."
    },
    {
        "question": "What does the motif of food represent in 'Like Water for Chocolate'?",
        "context": "In Laura Esquivel's 'Like Water for Chocolate,' food serves as a metaphor for emotion and communication. Recipes and meals reflect the characters' innermost feelings and relationships, intertwining the culinary with the magical."
    },
    {
        "question": "How does Octavia Butler address the theme of power and hierarchy in 'Kindred'?",
        "context": "In 'Kindred,' Octavia Butler explores power dynamics through Dana's experiences as she time-travels to a plantation in the antebellum South. The novel examines the complexities of power, survival, and moral compromise in a system of slavery."
    },
    {
        "question": "What is the significance of the recurring motif of mirrors in 'Neverwhere'?",
        "context": "In Neil Gaiman's 'Neverwhere,' mirrors symbolize self-reflection and alternate realities. They act as portals and metaphors for the blurred boundaries between the mundane and the fantastical, forcing characters to confront their identities."
    }
]

